darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
  if (sys.wifiOk && !webServerStarted) {
    start_webserver();
  }

  if (sys.wifiOk && webServerStarted) {
    webserver_handle();
    static unsigned long lastQueueProc = 0;
    if (now - lastQueueProc >= 60000UL) {
      queue_process();
      lastQueueProc = now;
    }
  }

  if (get_wifi_mode() == 1 && sys.wifiOk) {
    if (now - lastTsUpload >= TS_UPDATE_INTERVAL_MS) {
      float rtcT = rtc_temperature();
      if (!ts_send(sys.smoothedWeight, sys.tempData.temperature,
                   sys.tempData.humidity, rtcT)) {
        queue_add(sys.smoothedWeight, sys.tempData.temperature, 
                  sys.tempData.humidity, rtcT, sys.datetimeStr);
      }
      lastTsUpload = now;
    }

    // Отправка TG-отчёта в двух случаях:
    // 1. Сработало расписание (tgReportPending=true) — отправляем сразу в это пробуждение
    // 2. Расписания нет, и просто прошёл интервал (для непрерывного режима без расписания)
    uint32_t tgRptMs = get_tg_report_interval_min() * 60000UL;
    uint8_t schedCnt = 0; { uint16_t st[8]; get_sched_times(st, schedCnt); }
    bool doTgReport = false;
    if (tgReportPending) {
      doTgReport = true;
    } else if (schedCnt == 0 && tgRptMs > 0 && now - lastTgReport >= tgRptMs) {
      doTgReport = true;
    }
    if (doTgReport) {
      TimeStamp ts = rtc_now();
      String dt = rtc_format_datetime(ts);
      if (tg_send_report(sys.smoothedWeight, sys.tempData.temperature,
                         sys.tempData.humidity, dt, sys.prevWeight)) {
        tgReportPending = false;  // успешно отправлено — снимаем флаг
        lastTgReport = now;
      }
      // если не отправилось (нет WiFi, нет токена) — флаг остаётся, попробуем позже
    }
  }

  check_auto_sleep();

#ifdef SLEEP_MODE_DEEP_SLEEP
  {
    log_append(sys.datetimeStr, sys.smoothedWeight,
               sys.tempData.temperature, sys.tempData.humidity, sys.batVoltage, sys.batPercent);
  }
  persist.lastWeight = sys.smoothedWeight;
  persist.lastTempC = sys.tempData.temperature;
  persist.wakeupCount++;
  sleep_save_persistent(persist);
#if defined(ESP32)
  esp_task_wdt_delete(NULL);
#endif
  uint32_t sleepDur = sys.currentTime.valid
    ? sched_next_sec(sys.currentTime.hour, sys.currentTime.minute)
    : get_sleep_sec();
  // Guard: sched_next_sec() может вернуть 0 в пограничном случае ровно на минуте расписания.
  // Минимум 60 сек чтобы ESP не циклил "проснулся-уснул".
  if (sleepDur < 60) sleepDur = 60;
  Serial.print(F("[Sleep] Sleep for "));
  Serial.print(sleepDur);
  Serial.println(F(" sec"));
  sleep_enter(sleepDur);
#endif
}

void handle_buttons() {
  // Boot grace period: первые 2 секунды после старта игнорируем кнопки.
  // На ESP8266 это критично из-за boot-strap пинов GPIO0/2; на ESP32 (GPIO27/26 — RTC)
  // таких проблем нет, но небольшой grace всё равно защищает от наводок при инициализации I2C/WiFi.
  if (millis() < 2000UL) {
    // На всякий случай ещё раз чистим ISR-флаги
    noInterrupts();
    btnMain.irqFell = false;
    btnMenu.irqFell = false;
    interrupts();
    return;
  }

  ButtonAction actMain = read_button(BUTTON_PIN, btnMain);
  ButtonAction actMenu = read_button(MENU_BTN_PIN, btnMenu);

  // Запоминаем состояние подсветки ДО обновления — для wake-grace.
  // Если экран был погашен, и пользователь нажал MAIN — это "будящее" нажатие,
  // тарирование не запускаем (иначе при каждом приходе пчеловода случайная тара).
  bool wasBacklightOff = !lcd_backlight_is_on();

  // Подсветка: реагировать на физическое нажатие сразу, не ждать debounce/release
  bool anyPressed = (digitalRead(BUTTON_PIN) == LOW || digitalRead(MENU_BTN_PIN) == LOW);
  if (anyPressed || actMain != NO_ACTION || actMenu != NO_ACTION) {
    lastActivityTime = millis();
    lcd_backlight_activity(lcd);
  }

  // Логика MAIN-кнопки (v5.0.1, возвращена старая):
  //   1× SHORT  — запрос подтверждения "Tara? esche raz/3sek"
  //   2× SHORT за 3 сек — выполнить тарирование
  //   LONG (5 сек) — калибровка
  //   На экранах 6/7 — SHORT входит в режим (calib menu / diag)
  // Wake-grace: если экран был погашен — первое нажатие просто будит, не считается тарой.
  static int pressCount = 0;
  static unsigned long lastPressTime = 0;

  if (actMain == SHORT_PRESS) {
    if (sys.menuScreen == 6) {
      adjust_calibration();
      pressCount = 0;
      sys.needsRedraw = true;
    } else if (sys.menuScreen == 7) {
      diagRunRequested = true;
      pressCount = 0;
      sys.needsRedraw = true;
    } else if (wasBacklightOff && pressCount == 0) {
      // Wake-grace: подсветка была погашена → нажатие "будящее" → НЕ открываем диалог тары.
      // Геннадий пришёл к улью, нажал, увидел вес — этого достаточно.
      // Чтобы тарировать — после пробуждения нажать MAIN ещё раз (диалог откроется).
    } else {
      pressCount++;
      lastPressTime = millis();
      if (pressCount >= 2) {
        perform_taring();
        pressCount = 0;
      } else {
        // Первое нажатие — показываем запрос подтверждения
        lcd.clear();
        lcd.setCursor(0, 0); lcd_print_padded(lcd, "Tara? Nazhmite ");
        lcd.setCursor(0, 1); lcd_print_padded(lcd, "esche 1 raz/3sek");
      }
    }
  }
  if (actMain == LONG_PRESS && sys.menuScreen != 6 && sys.menuScreen != 7) {
    perform_calibration();
    pressCount = 0;
    sys.needsRedraw = true;
  }
  if (pressCount > 0 && millis() - lastPressTime > 3000UL) {
    // Таймаут окна подтверждения
    pressCount = 0;
    lcd.clear();
    lcd.setCursor(0, 0); lcd_print_padded(lcd, "Tara: otmena    ");
    lcd.setCursor(0, 1); lcd_print_padded(lcd, "                ");
    { unsigned long _t=millis(); while(millis()-_t<800UL){app_wdt_reset();yield();} }
    sys.needsRedraw = true;
  }
  static int menuPressCount = 0;
  static unsigned long lastMenuPressTime = 0;

  if (actMenu == SHORT_PRESS) {
    menuPressCount++;
    if (menuPressCount == 1) {
      lastMenuPressTime = millis();
    } else if (millis() - lastMenuPressTime < 500UL) {
      if (sys.hasPrevOffset) {
        undo_tare();
      } else {
        // Нет предыдущей тары — двойное нажатие = просто ещё один шаг меню
        sys.menuScreen = (sys.menuScreen + 1) % MENU_SCREENS;
        sys.needsRedraw = true;
      }
      menuPressCount = 0;
      return;
    } else {
      // Второе нажатие, но окно 500мс истекло (loop блокировался process_weight)
      // Прокручиваем меню за первое нажатие, текущее становится новым первым
      sys.menuScreen = (sys.menuScreen + 1) % MENU_SCREENS;
      sys.needsRedraw = true;
      menuPressCount = 1;
      lastMenuPressTime = millis();
    }
  }
  if (menuPressCount == 1 && millis() - lastMenuPressTime >= 500UL) {
    sys.menuScreen = (sys.menuScreen + 1) % MENU_SCREENS;
    sys.needsRedraw = true;
    menuPressCount = 0;
  }
  if (actMenu == LONG_PRESS) {
    sys.menuScreen = 0;
    menuPressCount = 0;
    sys.needsRedraw = true;
  }
}

void process_weight() {
  static unsigned long lastSaveTime         = 0;
  static unsigned long lastStableSaveTime   = 0;
  static unsigned long lastReadTime         = 0;
  static unsigned long lastPrevWeightSave   = 0;
  static float         lastSavedPrevWeight  = NAN;
  static float stableBuf[STABLE_BUF_SIZE];
  static int   stableBufIdx = 0;
  static int   stableBufCnt = 0;
  static bool  stableSaved  = false;

